export default {
  code: 0,
  user: [
    {
      id: 0,
      userName: 'jio',
      isAdmin: true,
      passWored: 123456,
      userImg: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1576138355161&di=301faa1d0521b47729f94bbf2b3429de&imgtype=0&src=http%3A%2F%2Fb.hiphotos.baidu.com%2Fzhidao%2Fwh%253D450%252C600%2Fsign%3Da324d475948fa0ec7f926c0913a775d8%2F0eb30f2442a7d9330961f235a84bd11372f001ae.jpg"
    }
  ],
  article: [
    {
      id: 0,
      title: "泉 千春",
      author: "宮城野 凛 （みやぎの りん）",
      createTime: "2019 2 1",
      main: "侵蚀日常的假寐的探求者', '米可莉・罗琦（ミクリ・ロキ）', '種族：人族 出身：梅菲公国身分：拔斗士（自由民） 属性：纯粹（无）、风武器：杖 戦闘：后卫魔法型技能：古代语、风秘印、睡眠不足等等持续了好多代的优秀魔术师一族的后裔，但某天与召唤的魔族订契约失败，中了『睡不着』的诅咒。这是若是身体一入睡，就会从莫名其妙的地方掉下东西（水盆等）砸中头，或是被路过的人不小心泼到水等等被强迫清醒的诅咒，没有任何办法熟睡。这是她的主要烦恼。因为诅咒很强大，凭自力无法解开，除了打倒施咒的魔族或是使用解咒用的特殊道具外别无他法。听说迎击都市格拉塞斯塔的地下迷宫里有各种各样的魔术品，为了寻找解咒用的魔术品而造访东戈迪亚王国。因为常时在与睡意搏斗，无法集中于战斗，再加上难以使用需要复杂的咒文的魔术，这种体质难以独自挑战迷宫，因此总是在寻找可靠的同伴。眼神锐利得给人一种被瞪着的感觉，但原因是因为睡眠不足。交谈起来就会表现出温和软弱的性格，会在意黑眼圈的性格与年龄相应的女孩子。', '「……啊。没问题，我没睡。因为如果我睡着了那想必肯定是发生什么巨大灾难了"
    },
    {
      id: 1,
      title: "若林 奈央",
      author: "谢莱 由凪（ユナギ・シャイエ）",
      createTime: "1019 8 3",
      main: "受罪孽所困的优雅狩猎者', '爱克塞尔・西翁（エクセル・シオル）', '種族：森妖精族 出身：马里＝琉那（精灵领） 身分：隶士(下层) 属性：地 武器：弓 戦闘：后卫远距型 技能：森狩人、古代语、病深化等 东戈迪亚王国迎击匠合所属的精灵隶士，被分配到第一个遭受魔物的危害的『隶士之笼』的奴隶的前辈。 言行端庄成熟，对任何人的态度都很好。  虽然是个外表美丽的精灵，但虽然身处身边一群粗野男性，完全说不上是安全的恶劣环境，但不知为何不打算离开下层。 不仅如此还从不沮丧，一副积极向上的样子，勤奋地教给杰达尔在迎击都市格拉塞斯塔该如何为人处世。  与舍己为人的样子相反，虽然是身份低贱的隶士，但其实是能完成高难度任务的「灾怨的狩猎者」之一，令人不敢轻视。 实力强大，每次任务都会生还，让人啧啧称奇。', '「和你的相遇，会将我带到更加激烈的战斗的舞台……我有这样的预感」,交谈起来就会表现出温和软弱的性格，会在意黑眼圈的性格与年龄相应的女孩子。', '「……啊。没问题，我没睡。因为如果我睡着了那想必肯定是发生什么巨大灾难了"
    }
  ],
  comment: [
    {
      id: 0,
      commentUser: "天线宝宝",
      commentTime: '2011 4 5',
      commentMain: "啊哈哈哈哈",
      commentArtId: 0
    },
    {
      id: 1,
      commentUser: "海绵宝宝",
      commentTime: '2011 4 1',
      commentMain: "派大星你好呀",
      commentArtId: 1
    },
    {
      id: 2,
      commentUser: "机器猫",
      commentTime: '2011 4 1',
      commentMain: "奥利给",
      commentArtId: 1
    },
    {
      id: 3,
      commentUser: "派大星",
      commentTime: '2011 4 5',
      commentMain: "买什么小米",
      commentArtId: 0
    }

  ]
}